[
  {
    "question_list_name": "Finance/Banking Data Engineer Study Plan",
    "question_list_description": "Career Goal: Data Engineer\n Summary: Interview Process:\n \n 1. Initial Phone Screen with Recruiter: This call typically lasts for about 15-30 minutes and is used to gauge initial interest and basic qualifications.\n \n 2. Coding/Technical Test: This test typically includes coding problems, SQL problems, or problems pertaining to data structures and algorithms. Tests are usually timed and may be conducted on platforms like CodeSignal. In some cases, a proctored environment may be required for the test.\n \n 3. Technical/Behavioral Interviews: This can involve multiple rounds with different interviewers, asking questions ranging from tech skills to past experience and behavioral questions. Length and number of interviews can vary.\n \n 4. Case Study/Project Assessment: Some companies may ask for a case study or assign projects related to the job. \n \n 5. Power Day Final Round: A series of interviews \"Power Day\" may be conducted by some companies. This includes multiple back-to-back interview rounds.\n \n 6. Job Offer: After successful completion of all stages, a job offer is extended.\n \n Interview Tips:\n \n 1. Preparation is crucial: Review concepts related to data structures, algorithms, and coding problems in different languages.\n \n 2. Familiarize yourself with SQL and platforms like CodeSignal (used frequently for assessments).\n \n 3. Clear communication: Some interviewers may not speak English as their first language. Ensuring clear communication can help avoid any misunderstandings.\n \n 4. Frame your responses in a structured way: Clearly state the problem, your approach and explain your solution.\n \n 5. Remember, interviewers are assessing how you solve problems. It's not just about the 'right answer,' but also how you arrived at it.\n \n Tips for Aspiring Data Engineers in Finance:\n \n 1. Master SQL: This is used extensively in data engineering roles. Ensure that you know it well.\n \n 2. Familiarize yourself with Big Data and Hadoop: These are commonly used tools in the finance industry. \n \n 3. Brush up on DevOps and AWS: They are essential to data engineering roles.\n \n 4. Be prepared for operations-research type problems and operating systems scheduling problems.\n \n 5. Be patient: Hiring processes can be lengthy, especially in large financial institutions. Follow up regularly with recruiters about your application status.\n \n Note: Many candidates reported a disconnect between the skills tested in the interview process and the actual requirements of data engineering roles. They often found the interviewing process strenuous, sometimes convoluted and protracted. A significant number of applicants felt some questions were too academic and not a fair reflection of the professional aptitude required for the job.",
    "is_default": false
  },
  {
    "question_list_name": "Top 50 Most Common Data Engineer Interview Questions",
    "question_list_description": "Career Goal: Data Engineer\n Summary: ### Summary of Data Engineer Interview Process Across Companies\n \n **Common Stages:**\n 1. **Initial Screening:**\n  - **HR Call:** Basic verification, discussion of resume, relocation, salary range, and visa status.\n  - **First Technical Screening (Phone/Video):** Verification of fundamental skills such as SQL, Python, and initial problem-solving abilities.\n \n 2. **Technical Rounds:**\n  - **SQL & Python Questions:** Test on writing algorithms, tree questions, data pipeline concepts, and current projects.\n  - **Hands-On Tasks:** Problem-solving tasks involving cloud data engineering tools (e.g., Azure, Databricks).\n  - **System Design:** Propose designs for specific use cases, showcasing data architecture skills.\n \n 3. **Behavioral & Cultural Fit:**\n  - **Interpersonal Interviews:** Questions about work culture, stress management, and scenarios to assess fit within the team.\n  - **Management Interviews:** Standard questions around experience, decision-making under pressure, and career goals.\n \n 4. **Final Rounds:**\n  - **Technical Deep Dives:** More comprehensive technical assessment, including coding tasks and discussions on tech stacks.\n  - **Loop Interviews:** Multiple interviews with team members to cover various aspects (technical, behavioral, and cultural).\n \n ### Interview Tips:\n 1. **SQL & Python Proficiency:**\n  - Brush up basic and advanced SQL queries.\n  - Practice Python coding, especially algorithm challenges and tree/graph problems.\n \n 2. **Cloud Platforms:**\n  - Gain hands-on experience with cloud-based tools like Azure, Databricks, and data processing frameworks.\n \n 3. **System Design:**\n  - Prepare to design data systems, focusing on scalability and efficiency.\n  - Study examples of data architectures and understand best practices.\n \n 4. **Behavioral Readiness:**\n  - Be prepared to discuss past experiences, how you handle stress, and fit with the company culture.\n  - Think of examples that showcase teamwork, problem-solving, and adaptability.\n \n 5. **Mock Interviews:**\n  - Practice with peers or use online platforms to simulate real interview scenarios.\n \n 6. **Know the Company:**\n  - Research the company’s tech stack and recent projects to tailor your answers with relevant insights.\n \n ### Preparation Tips:\n - **Leetcode:** Practice coding problems daily.\n - **Interview Books:** Read \"Cracking the Coding Interview\" and \"Designing Data-Intensive Applications.\"\n - **Online Courses:** Use platforms like Coursera, Udemy, or edX to strengthen technical skills.\n - **Tech Blogs:** Follow tech blogs to stay updated on industry trends and tools.",
    "is_default": true
  },
  {
    "question_list_name": "Pathway to FAANG",
    "question_list_description": "Career Goal: Data Engineer\n Summary: The interview process for a Data Engineer at big tech companies generally involves various stages. Recruiters initially contact candidates for screening interviews, discussing topics like relocation, salary range, and visa status. Technical interviews involve writing algorithms, answering database queries, and problem-solving exercises with a focus on cloud-based data engineering. There can also be assessments aimed at testing hands-on, analytical, and problem-solving abilities.\n \n Interview rounds can range from one to five, involving multiple interviewers. These can be a combination of technical assessments, system design questions, and behavioral interviews which gauge how well you would fit into the company's culture. The questions can cover a range of topics such as SQL, Python, data structure algorithms, data modeling, data warehousing concepts, cloud concepts, databricks, data factory, and ETL design.\n \n For success in the interview process, it is important to have proficiency in SQL and Python and a well-rounded understanding of data structures and algorithms. Strong competency in the English language, problem-solving, and communication skills are crucial. Reviewing the company’s leadership principles may be beneficial as they often shape the behavioral questions. Additionally, candidates should be familiar with using the native data structures provided by their chosen interview language or be prepared to implement them. Candidates should prepare to share specific examples from their past experience, presenting them in the STAR (Situation, Task, Action, Result) format is often well-received. Being patient and persistent throughout the process is advised.\n \n Moreover, it's important to note that despite answering all questions correctly, there may be various reasons for not proceeding further, including but not limited to not being a cultural fit, lack of required experience, internal changes within the company, or not being proficient with the specific tools/software the company utilizes.",
    "is_default": false
  },
  {
    "question_list_name": "Amazon Data Engineer Study Plan",
    "question_list_description": "de_amazon",
    "is_default": false
  }
]